INSERT INTO hotels (name, location, services, rooms_quantity, image_id) VALUES
('Cosmos Collection Altay Resort', 'Республика Алтай, Майминский район, село Урлу-Аспак, Лесхохная улица, 20', '["WI-FI","Парковка"]', 25, 1),
('Skala','Респулика Алтай, Майминский район, поселок Барангол, Чуйская улица, 40А', '["WI-FI","Парковка"]', 23, 2),
('Ару-Кёль','Респулика Алтай, Турочаский район, село Артыбаш, Телецкая улица, 44А', '["Парковка"]', 30, 3),
('Гостиница Сыктывкар','Респулика Коми, Сыктывкар, Коммунистическая улица, 67', '["WI-FI","Парковка","Тренажерный зал"]', 27, 4),
('Palace','Респулика Коми, Сыктывкар, Коммунистическая улица, 62', '["WI-FI","Парковка","Кондиционер в номере"]', 22, 5),
('Bridge Resort','поселок городского типа Сириус, Фигурная улица, 45', '["WI-FI","Парковка","Кондиционер в номере"]', 21, 6);

INSERT INTO rooms(hotels_id, name, price, quantity, services, image_id) VALUES
(1, 'Улучшенный с террасой и видом на море', 24500, 5, '["Беспалтный WI-FI", "Кондиционер (с климат-контролем)"]', 7),
(1, 'Делюкс плюс', 22450, 10, '["Беспалтный WI-FI", "Кондиционер"]', 8),
(2, 'Номер на 2-х человек', 4750, 15, '[]', 9),
(2, 'Номер на 3-х человек', 4350, 8, '[]', 10),
(3, 'Номер полулюкс семейный с 1 двуспальной кроватью', 7080, 20, '["Холодильник"]', 11),
(3, '2-комнатный номер люкс комфорт', 9815, 10, '[]', 12),
(4, 'Стандартный двухместный', 4300, 20, '["Беспалтный WI-FI", "Холодильник"]', 13),
(4, 'Стандартный улучшеный ПЛЮС', 4700, 35, '["Беспалтный WI-FI", "Холодильник", "Ванная комната", "Кондиционер"]', 14),
(5, 'Номер стандарт с 2 односпальными кроватями (с завтраком)', 5000, 15, '[]', 15),
(5, 'Номер полулюкс премиум (с завтраком)', 8000, 7, '[]', 16),
(6, 'Стандарт(типовой корпус)', 8125, 45, '[]', 17);

INSERT INTO users (email, hashed_password) VALUES
('fedor@moloko.ru', 'tut_budet_hashed_password_1'),
('sharik@moloko.ru', 'tut_budet_hashed_password_2');

INSERT INTO booking (room_id, user_id, date_from, date_to, price) VALUES
(1, 1, '2023-06-15', '2023-06-30', 24500),
(7, 2, '2023-06-25', '2023-07-10', 4300);
